brew "bash"
brew "bat"
brew "bottom"
brew "chezmoi"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "git"
brew "imagemagick" # yazi dependency
brew "jq"
brew "lsd"
brew "mas"
brew "micro"
brew "neovim"
brew "pnpm"
brew "poppler" # yazi dependency
brew "resvg" # yazi dependency
brew "ripgrep"
brew "rustup"
brew "sevenzip" # yazi dependency
brew "starship"
brew "tlrc"
brew "tmux"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "zsh"

cask "1password"
cask "1password-cli"
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "aldente"
cask "balenaetcher"
cask "bambu-studio"
cask "bartender"
cask "chatgpt"
cask "cleanmymac"
cask "codex"
cask "devutils"
cask "discord"
cask "firefox"
cask "folx"
cask "font-hack-nerd-font"
cask "font-symbols-only-nerd-font" # yazi dependency
cask "forklift"
cask "ghostty"
cask "google-chrome"
cask "iina"
cask "insta360-link-controller"
cask "insta360-studio"
cask "jetbrains-toolbox"
cask "keka"
cask "lunar"
cask "netspot"
cask "nextcloud"
cask "orbstack"
cask "plex"
cask "proton-mail"
cask "protonvpn"
cask "raycast"
cask "renamer"
cask "slack"
cask "spotify"
cask "steelseries-gg"
cask "steam"
cask "synology-drive"
cask "tailscale-app"
cask "viscosity"
cask "zed"

mas "Compressor", id: 424390742
mas "Darkroom", id: 953286746
mas "Final Cut Pro", id: 424389933
mas "Home Assistant", id: 1099568401
mas "Logic Pro", id: 634148309
mas "LosslessCut", id: 1505323402
mas "Magnet", id: 441258766
mas "MainStage", id: 634159523
mas "Motion", id: 434290957
mas "Screens 5", id: 1663047912
mas "Telegram", id: 747648890
mas "TextSniper", id: 1528890965
mas "Yoink", id: 457622435
