tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "oven-sh/bun"
tap "withgraphite/tap"

brew "bash"
brew "bat"
brew "bun"
brew "exa"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "mas"
brew "node"
brew "pipx"
brew "pnpm"
brew "python"
brew "rustup"
brew "tlrc"
brew "tmux"
brew "wget"
brew "withgraphite/tap/graphite"
brew "zoxide"
brew "zsh"

cask "1password"
cask "1password-cli"
cask "adobe-creative-cloud"
cask "aldente"
cask "android-studio"
cask "authy"
cask "balenaetcher"
cask "bartender"
cask "blender"
cask "chatgpt"
cask "cleanmymac"
cask "curseforge"
cask "devutils"
cask "discord"
cask "docker"
cask "firefox"
cask "flutter"
cask "folx"
cask "google-chrome"
cask "iina"
cask "insta360-studio"
cask "intellij-idea"
cask "istat-menus"
cask "iterm2"
cask "keka"
cask "lunar"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "minecraft"
cask "miniforge"
cask "netspot"
cask "plex"
cask "postman"
cask "protonvpn"
cask "renamer"
cask "rocket"
cask "slack"
cask "synology-chat"
cask "synology-drive"
cask "synology-surveillance-station-client"
cask "spotify"
cask "steam"
cask "tailscale"
cask "viscosity"
cask "visual-studio-code"
cask "warp"
cask "zoom"

mas "Apple Remote Desktop", id: 409907375
mas "Compressor", id: 424390742
mas "Final Cut Pro", id: 424389933
mas "Home Assistant", id: 1099568401
mas "Logic Pro", id: 634148309
mas "Magnet", id: 441258766
mas "MainStage", id: 634159523
mas "Messenger", id: 1480068668
mas "Motion", id: 434290957
mas "PastePal", id: 1503446680
mas "TextSniper", id: 1528890965
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
mas "Yoink", id: 457622435
