tap "homebrew/bundle"

brew "bash"
brew "bat"
brew "chezmoi"
brew "fd" # yazi optional dependency
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gemini-cli"
brew "git"
brew "imagemagick" # yazi optional dependency
brew "jq" # yazi optional dependency
brew "lsd"
brew "mas"
brew "micro"
brew "neovim"
brew "pnpm"
brew "poppler" # yazi optional dependency
brew "resvg" # yazi optional dependency
brew "ripgrep" # yazi optional dependency
brew "rustup"
brew "sevenzip" # yazi optional dependency
brew "starship"
brew "tlrc"
brew "tmux"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "zsh"

cask "1password"
cask "1password-cli"
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "aldente"
cask "authy"
cask "balenaetcher"
cask "bambu-studio"
cask "bartender"
cask "blender"
cask "cleanmymac"
cask "curseforge"
cask "devutils"
cask "discord"
cask "docker-desktop"
cask "firefox"
cask "folx"
cask "font-hack-nerd-font"
cask "font-symbols-only-nerd-font" # yazi optional dependency
cask "ghostty"
cask "google-chrome"
cask "homerow"
cask "iina"
cask "insta360-studio"
cask "istat-menus"
cask "jetbrains-toolbox"
cask "keka"
cask "lm-studio"
cask "lunar"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "minecraft"
cask "netspot"
cask "plex"
cask "postman"
cask "proton-mail"
cask "protonvpn"
cask "raycast"
cask "renamer"
cask "slack"
cask "spotify"
cask "steelseries-gg"
cask "steam"
cask "synology-chat"
cask "synology-drive"
cask "synology-surveillance-station-client"
cask "tailscale-app"
cask "viscosity"
cask "visual-studio-code"
cask "warp"
cask "zoom"

mas "Compressor", id: 424390742
mas "Darkroom", id: 953286746
mas "Final Cut Pro", id: 424389933
mas "Home Assistant", id: 1099568401
mas "Logic Pro", id: 634148309
mas "LosslessCut", id: 1505323402
mas "Magnet", id: 441258766
mas "MainStage", id: 634159523
mas "Messenger", id: 1480068668
mas "Motion", id: 434290957
mas "Screens 5", id: 1663047912
mas "TextSniper", id: 1528890965
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
mas "Yoink", id: 457622435
